name: "bert_classifier"
backend: "onnxruntime"
max_batch_size: 32

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [64]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [64]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [1]
  }
]

dynamic_batching {}